КАКерамика_моя_старая_база/src/InformationRegisters/КонтурЛогистика_СервисФизическихЛиц/КонтурЛогистика_СервисФизическихЛиц.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КонтурЛогистика_СервисФизическихЛиц</name>
  <resources>
    <name>PersonId</name>
    <comment>Идентификатор физического лица в сервисе физ лиц. У одного сотрудника будут разные id в разных организациях</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>UserId</name>
    <comment>Идентификатор связанного портального пользователя. Появляется после принятия приглашения. Для водителей связка выполняется по номеру телефона. Для разных personId может быть один UserId</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.КонтурЛогистика_СтатусыФизическихЛиц</types>
    </type>
  </resources>
  <attributes>
    <name>ОписаниеОшибки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьОшибка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>InviteId</name>
    <comment>Идентификатор приглашения</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СНИЛС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТелефонОсновной</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресЭлектроннойПочты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВУДатаВыдачи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВУНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВУСерия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IdentityDocumentId</name>
    <comment>Идентификатор документа в сервисе физ. лиц</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТелефонСовпадает</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СценарийПриглашения</name>
    <type>
      <types>EnumRef.КонтурЛогистика_СценарииПриглашенийФизическихЛиц</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_СтатусыФизическихЛиц/КонтурЛогистика_СтатусыФизическихЛиц.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_СтатусыФизическихЛиц</name>
  <enumValues>
    <name>НеСоздано</name>
  </enumValues>
  <enumValues>
    <name>НеОтправленоПриглашение</name>
  </enumValues>
  <enumValues>
    <name>ОтправленоПриглашение</name>
  </enumValues>
  <enumValues>
    <name>ПринятоПриглашение</name>
  </enumValues>
  <enumValues>
    <name>Удалено</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_СценарииПриглашенийФизическихЛиц/КонтурЛогистика_СценарииПриглашенийФизическихЛиц.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_СценарииПриглашенийФизическихЛиц</name>
  <enumValues>
    <name>Водитель</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/Catalogs/КонтурЛогистика_Сотрудники/КонтурЛогистика_Сотрудники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КонтурЛогистика_Сотрудники</name>
  <attributes>
    <name>ВУДатаВыдачи</name>
    <comment>(Для водителя) Обязателен при отсутствии ИНН физ. лица</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВУНомер</name>
    <comment>(Для водителя) Обязателен при отсутствии ИНН физ. лица</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВУСерия</name>
    <comment>(Для водителя) Обязателен при отсутствии ИНН физ. лица</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <comment>(Для кладовщика) если кладовщик указывается, то обязательно</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <comment>обязательно</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <comment>ИНН физического лица, Обязателен при отсутствии &lt;НомВУ> и &lt;СерВУ> и &lt;ДатаВыдВУ></comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИныеСведения</name>
    <comment>(Для кладовщика) Иные сведения, идентифицирующие физическое лицо</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОснованиеПолномочий</name>
    <comment>(Для кладовщика) Основание полномочий ТЕКСТ (доверия) на осуществление действий по погрузке груза в транспортное средство: по умолч: &quot;должностные обязанности&quot;</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОснованиеПолномочийДоговор</name>
    <comment>(Для кладовщика)  Основание полномочий ДОГОВОР (доверия) на осуществление действий по погрузке груза в транспортное средство</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <comment>необязательно</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РольВодитель</name>
    <comment>Признак, что Может выступать в качестве водителя</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РольКладовщик</name>
    <comment>Признак, что Может выступать в качестве кладовщика</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РольМедик</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МедЛицензия</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_Лицензии</types>
    </type>
  </attributes>
  <attributes>
    <name>РольМеханик</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТелефонЗапасной</name>
    <comment>необязателен</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТелефонОсновной</name>
    <comment>обязателен, в любом формате</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Фамилия</name>
    <comment>обязательно</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресМестаЖительства</name>
    <comment>АдрИнфТип</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресМестаЖительстваСтрана</name>
    <comment>АдрИнфТип</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_СтраныМира</types>
    </type>
  </attributes>
  <attributes>
    <name>СНИЛС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресЭлектроннойПочты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТелефонЗарегестрированВТелеграм</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДОПОГСерия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДОПОГНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДОПОГДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИныеКонтактныеДанные</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СвязанныеОбъекты</name>
    <attributes>
      <name>СвязанныйОбъект</name>
      <type>
        <types>DefinedType.КонтурЛогистика_ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>УИД</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипЗначенияУИД</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РазрешенияРаботыСДокументами</name>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
      </type>
    </attributes>
    <attributes>
      <name>МожетПодписывать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>МожетПередаватьНаПодпись</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

КАКерамика_моя_старая_база/src/InformationRegisters/КонтурЛогистика_СервисФизическихЛиц/Forms/ФормаГрупповоеДобавлениеСотрудниковВОрганизацию/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Отбор = "НеДобавленные";	
		
	Команды.КомандаПоУмолчанию.Подсказка = "Команда выполняет действия с отмеченными строками:
		|  Добавить в организацию - отправить приглашение сотруднику по номеру телефона в сервис
		|  Проверить приглашение - проверить отправленное ранее приглашение
		|  Переотправить - заново отправить приглашение сотруднику";
	
	
	Организация = КонтурЛогистика_ИнтеграцияAPI_СервисФизическихЛицПовтИсп.ОрганизацияПоУмолчанию();
	Если ЗначениеЗаполнено(Организация) Тогда
		ЗаполнитьТаблицуСотрудники();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УправлениеЭлементамиФормы();
	
	Элементы.Протокол.Видимость = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "КонтурЛогистика_ОбновитьФизическиеЛица" Тогда
		ЗаполнитьТаблицуСотрудники();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбновитьТаблицуСотрудников(Команда)
	ЗаполнитьТаблицуСотрудники();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажки(Команда)
	
	Если Отбор = "ПринялиПриглашение" Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого Стр Из Сотрудники Цикл		
		
		Если Отбор = "Все" И (Стр.Статус = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыФизическихЛиц.ПринятоПриглашение")
			Или Стр.Статус = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыФизическихЛиц.Удалено")) Тогда
			Продолжить;
		КонецЕсли;
		
		Стр.Пометка = Истина;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажки(Команда)
	
	Для каждого Стр Из Сотрудники Цикл
		Стр.Пометка = Ложь;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПоУмолчанию(Команда)
	
	Если КомандаПоУмалчанию = "ДобавитьВОрганизацию" Тогда
		ВыполнитьКомандуДобавитьВОрганизацию();
	ИначеЕсли КомандаПоУмалчанию = "ПроверитьПриглашение" Тогда
		ВыполнитьКомандуПроверитьПриглашение();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуДобавитьВОрганизацию()
	
	КонтурЛогистика_Метрика.ЗарегистрироватьДействиеПользователя("Групповое добавление сотрудников", "Добавить в организацию", 
		"РегистрСведений.КонтурЛогистика_СервисФизическихЛиц.Форма.ФормаГрупповоеДобавлениеСотрудниковВОрганизацию");
	
	Элементы.Протокол.Видимость = Истина;
	
	ДобавитьВПротокол("=== Начало обработки ===");
		
	Для каждого Стр Из Сотрудники Цикл
		
		Если Не Стр.Пометка Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Стр.ПредупрежденияСотрудника) Тогда
			ДобавитьВПротокол("У сотрудника " + Стр.Сотрудник + " " + Стр.ПредупрежденияСотрудника);
			Продолжить;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Стр.Телефон) Тогда
			ДобавитьВПротокол("У сотрудника " + Стр.Сотрудник + " не заполнен телефон");
			Продолжить;
		КонецЕсли; 
		
		Результат = КонтурЛогистика_СервисФизическихЛицСервер.ОтправитьПриглашение(
			Стр.Организация, Стр.Сотрудник, Перечисления.КонтурЛогистика_СценарииПриглашенийФизическихЛиц.Водитель, Стр.Телефон, Стр.Статус, Стр.PersonId);
			
		Если Результат.ЕстьОшибка Тогда
			КонтурЛогистика_Метрика.ОбработатьОшибку("ГрупповоеДобавлениеСотрудников", Результат.ОписаниеОшибки, Стр.Сотрудник);
		КонецЕсли;
			
		Если Результат.ЕстьОшибка Тогда
			ДобавитьВПротокол("При отправление приглашения " + Стр.Сотрудник + " произошла ошибка: " + Результат.ОписаниеОшибки);
		Иначе
			ДобавитьВПротокол("Сотруднику " + Стр.Сотрудник + " отправлено приглашение для добавления в организацию");
		КонецЕсли;
			
	КонецЦикла;
	
	ДобавитьВПротокол("=== Окончание обработки ===");
	
	ЗаполнитьТаблицуСотрудники();
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуПроверитьПриглашение()
	
	Элементы.Протокол.Видимость = Истина;
	
	ДобавитьВПротокол("=== Начало обработки ===");
		
	Для каждого Стр Из Сотрудники Цикл
		
		Если Не Стр.Пометка Тогда
			Продолжить;
		КонецЕсли;
		
		ПриглашениеПринято = Ложь;
		
		Попытка
			
			КонтурЛогистика_СервисФизическихЛицСервер.ПроверитьПриглашение(
				Стр.Организация, Стр.Сотрудник, Перечисления.КонтурЛогистика_СценарииПриглашенийФизическихЛиц.Водитель, Стр.PersonId, ПриглашениеПринято);
			
		Исключение
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			ДобавитьВПротокол(КраткоеПредставлениеОшибки(ИнформацияОбОшибке));
		КонецПопытки;
		
		Если ПриглашениеПринято Тогда
			ДобавитьВПротокол("Сотрудник " + Стр.Сотрудник + " принял приглашение");
		КонецЕсли;
		
	КонецЦикла;
	
	ДобавитьВПротокол("=== Окончание обработки ===");
	
	ЗаполнитьТаблицуСотрудники();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементов

&НаКлиенте
Процедура ОтборПриИзменении(Элемент)
	
	ЗаполнитьТаблицуСотрудники();
	
	УправлениеЭлементамиФормы()
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	ПараметрыФормы = Новый Структура("Ключ, ПерейтиНаФизическихЛиц", ТекущиеДанные.Сотрудник, Истина);
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы("Справочник.КонтурЛогистика_Сотрудники.Форма.ФормаЭлемента", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияПротоколНажатие(Элемент)
	
	Элементы.Протокол.Видимость = Не Элементы.Протокол.Видимость;
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	НастройкиКД = Новый НастройкиКомпоновкиДанных;
	
	ДоступныеОрганизации = КонтурЛогистика_ИнтеграцияAPI_СервисФизическихЛицПовтИсп.ДоступныеОрганизацииДляСервисаФизЛиц();
	ОтборСписка = НастройкиКД.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборСписка.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
	ОтборСписка.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	ОтборСписка.ПравоеЗначение = ДоступныеОрганизации;
	ОтборСписка.Использование = Истина;
	
	ПараметрыВыбора = Новый Структура;
	ПараметрыВыбора.Вставить("ФиксированныеНастройки", НастройкиКД);
	ПараметрыВыбора.Вставить("СкрытьОтбор");
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы(
		"Справочник.КонтурЛогистика_ОрганизацииДиадок.Форма.ФормаВыбора", ПараметрыВыбора, ЭтаФорма, ЭтаФорма, "ОбработчикВыбораОрганизации");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьЗаголовокКомандыПоУмолчанию()
	
	Если Отбор = "Все" Тогда
		Элементы.ФормаДействиеПоУмолчанию.Заголовок = "Переотправить и проверить приглашение";
	ИначеЕсли Отбор = "НеДобавленные" Тогда
		Элементы.ФормаДействиеПоУмолчанию.Заголовок = "Добавить в организацию";
		КомандаПоУмалчанию = "ДобавитьВОрганизацию";
	ИначеЕсли Отбор = "НеПринятые" Тогда
		Элементы.ФормаДействиеПоУмолчанию.Заголовок = "Проверить приглашение";
		КомандаПоУмалчанию = "ПроверитьПриглашение";
	ИначеЕсли Отбор = "СОшибкой" Тогда
		Элементы.ФормаДействиеПоУмолчанию.Заголовок = "Переотправить";
		КомандаПоУмалчанию = "ДобавитьВОрганизацию";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УправлениеЭлементамиФормы()
	
	УстановитьЗаголовокКомандыПоУмолчанию();
	
	Элементы.СотрудникиОписаниеОшибки.Видимость = Отбор = "СОшибкой";
	Элементы.ФормаДействиеПоУмолчанию.Видимость = Отбор <> "ПринялиПриглашение" И Отбор <> "Все";
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуСотрудники()
	
	Если Не ЗначениеЗаполнено(Организация) Тогда
		Сотрудники.Очистить();
		Возврат;
	КонецЕсли;
	
	тз = РеквизитФормыВЗначение("Сотрудники");
	
	тз.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КонтурЛогистика_Сотрудники.Ссылка КАК Сотрудник,
		|	КонтурЛогистика_Сотрудники.ТелефонОсновной КАК Телефон,
		|	КонтурЛогистика_СервисФизическихЛиц.Организация КАК Организация,
		|	КонтурЛогистика_СервисФизическихЛиц.PersonId КАК PersonId,
		|	КонтурЛогистика_СервисФизическихЛиц.UserId КАК UserId,
		|	КонтурЛогистика_СервисФизическихЛиц.InviteId КАК InviteId,
		|	КонтурЛогистика_СервисФизическихЛиц.IdentityDocumentId КАК IdentityDocumentId,
		|	КонтурЛогистика_СервисФизическихЛиц.ЕстьОшибка КАК ЕстьОшибка,
		|	КонтурЛогистика_СервисФизическихЛиц.ОписаниеОшибки КАК ОписаниеОшибки,
		|	ЕСТЬNULL(КонтурЛогистика_СервисФизическихЛиц.Статус, ЗНАЧЕНИЕ(Перечисление.КонтурЛогистика_СтатусыФизическихЛиц.ПустаяСсылка)) КАК Статус,
		|	КонтурЛогистика_Сотрудники.Фамилия КАК Фамилия,
		|	КонтурЛогистика_Сотрудники.Имя КАК Имя,
		|	КонтурЛогистика_Сотрудники.Отчество КАК Отчество,
		|	КонтурЛогистика_Сотрудники.ВУСерия КАК ВУСерия,
		|	КонтурЛогистика_Сотрудники.ВУНомер КАК ВУНомер,
		|	КонтурЛогистика_Сотрудники.ВУДатаВыдачи КАК ВУДатаВыдачи
		|ИЗ
		|	Справочник.КонтурЛогистика_Сотрудники КАК КонтурЛогистика_Сотрудники
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтурЛогистика_СервисФизическихЛиц КАК КонтурЛогистика_СервисФизическихЛиц
		|		ПО КонтурЛогистика_Сотрудники.Ссылка = КонтурЛогистика_СервисФизическихЛиц.Сотрудник
		|ГДЕ
		|	НЕ КонтурЛогистика_Сотрудники.ПометкаУдаления
		|	И КонтурЛогистика_Сотрудники.РольВодитель
		|	И КонтурЛогистика_СервисФизическихЛиц.Статус ЕСТЬ NULL
		|
		|УПОРЯДОЧИТЬ ПО
		|	Фамилия,
		|	Имя,
		|	Отчество";
	
	Если Отбор = "Все" Тогда
		Запрос.Текст  = СтрЗаменить(Запрос.Текст, "И КонтурЛогистика_СервисФизическихЛиц.Статус ЕСТЬ NULL", "");
	ИначеЕсли Отбор = "НеПринятые" Тогда
		Запрос.Текст  = СтрЗаменить(Запрос.Текст, "И КонтурЛогистика_СервисФизическихЛиц.Статус ЕСТЬ NULL", 
			"И КонтурЛогистика_СервисФизическихЛиц.Статус = &Статус");
		Запрос.УстановитьПараметр("Статус", Перечисления.КонтурЛогистика_СтатусыФизическихЛиц.ОтправленоПриглашение);
	ИначеЕсли Отбор = "ПринялиПриглашение" Тогда
		Запрос.Текст  = СтрЗаменить(Запрос.Текст, "И КонтурЛогистика_СервисФизическихЛиц.Статус ЕСТЬ NULL", 
			"И КонтурЛогистика_СервисФизическихЛиц.Статус = &Статус");
		Запрос.УстановитьПараметр("Статус", Перечисления.КонтурЛогистика_СтатусыФизическихЛиц.ПринятоПриглашение);
	ИначеЕсли Отбор = "СОшибкой" Тогда
		Запрос.Текст  = СтрЗаменить(Запрос.Текст, "И КонтурЛогистика_СервисФизическихЛиц.Статус ЕСТЬ NULL", 
			"И КонтурЛогистика_СервисФизическихЛиц.ЕстьОшибка");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Организация) И Отбор <> "НеДобавленные" Тогда
		Запрос.Текст  = СтрЗаменить(Запрос.Текст, "И КонтурЛогистика_Сотрудники.РольВодитель", 
			"И КонтурЛогистика_Сотрудники.РольВодитель И КонтурЛогистика_СервисФизическихЛиц.Организация = &Организация ");
		Запрос.УстановитьПараметр("Организация", Организация);
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		НоваяСтрока = тз.Добавить();
		НоваяСтрока.Сотрудник = ВыборкаДетальныеЗаписи.Сотрудник;
		НоваяСтрока.Телефон = ВыборкаДетальныеЗаписи.Телефон;
		НоваяСтрока.Организация = Организация;
		НоваяСтрока.Статус = ВыборкаДетальныеЗаписи.Статус;
		НоваяСтрока.PersonId = ВыборкаДетальныеЗаписи.PersonId;
		НоваяСтрока.UserId = ВыборкаДетальныеЗаписи.UserId;
		НоваяСтрока.InviteId = ВыборкаДетальныеЗаписи.InviteId;
		НоваяСтрока.IdentityDocumentId = ВыборкаДетальныеЗаписи.IdentityDocumentId;
		НоваяСтрока.ОписаниеОшибки = ВыборкаДетальныеЗаписи.ОписаниеОшибки;
		
		Предупреждения = Новый Массив;
		Если Не ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Фамилия) Тогда 
			Предупреждения.Добавить("фамилия");
		КонецЕсли;
		Если Не ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Имя) Тогда 
			Предупреждения.Добавить("имя");
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ВУСерия) Тогда 
			Предупреждения.Добавить("серия ВУ");
		КонецЕсли;
		Если Не ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ВУНомер) Тогда 
			Предупреждения.Добавить("номер ВУ");
		КонецЕсли;
		Если Не ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ВУДатаВыдачи) Тогда 
			Предупреждения.Добавить("дата выдачи ВУ");
		КонецЕсли;
		
		Если Предупреждения.Количество() = 1 Тогда
			
			Если Предупреждения[0] = "имя" Тогда
				ПредупрежденияЗаголовок = "не заполнено";
			ИначеЕсли Предупреждения[0] = "номер ВУ" Тогда
				ПредупрежденияЗаголовок = "не заполнен";
			Иначе
				ПредупрежденияЗаголовок = "не заполнена";
			КонецЕсли;
			
			НоваяСтрока.ПредупрежденияСотрудника = ПредупрежденияЗаголовок + " " 
				+ КонтурЛогистика_СтдСтрКлиентСервер.СтрСоединитьЛок(Предупреждения, ",");
				
		ИначеЕсли Предупреждения.Количество() > 1 Тогда
				
			НоваяСтрока.ПредупрежденияСотрудника = "не заполнены " 
				+ КонтурЛогистика_СтдСтрКлиентСервер.СтрСоединитьЛок(Предупреждения, ", ");
				
		КонецЕсли;
						
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(тз, "Сотрудники");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикВыбораОрганизации(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Организация = ВыбранноеЗначение;
	
	ЗаполнитьТаблицуСотрудники();
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ЗаполнитьТаблицуСотрудники();
КонецПроцедуры

&НаСервере
Процедура ДобавитьВПротокол(ТекстСообщения)
	
	Протокол = Строка(ТекущаяДатаСеанса()) + " " + ТекстСообщения
		+ ?(Протокол = "", "", Символы.ПС) + Протокол;
	
КонецПроцедуры

#КонецОбласти
